var addressInit = function(_category,_division, _group, _section,defaultCategory, defaultDivision, defaultGroup, defaultSection)  
{  
    var category=document.getElementById(_category);  
    var division = document.getElementById(_division);  
    var group = document.getElementById(_group);  
    var section = document.getElementById(_section);  
    function cmbSelect(cmb, str)  
    {  
        for(var i=0; i<cmb.options.length; i++)  
        {  
            if(cmb.options[i].value == str)  
            {  
                cmb.selectedIndex = i;  
                return;  
            }  
        }  
    }  
    function cmbAddOption(cmb, str, obj)  
    {  
        var option = document.createElement("OPTION");  
        option.innerHTML = str;  
        option.value = str;  
        option.obj = obj;  
        cmb.options.add(option);  
    }  
      
    function changeGroup()  
    {  
        section.options.length = 0;  
        if(group.selectedIndex == -1)return;  
        var item = group.options[group.selectedIndex].obj;  
        for(var i=0; i<item.sectionList.length; i++)  
        {  
            cmbAddOption(section, item.sectionList[i], null);  
        }  
        cmbSelect(section, defaultSection);  
    }  
    function changeDivision()  
    {  
        group.options.length = 0;  
        group.onchange = null;  
        if(division.selectedIndex == -1)return;  
          
        var item = division.options[division.selectedIndex].obj;  
        for(var i=0; i<item[division.selectedIndex].groupList.length; i++)  
        {  
            cmbAddOption(group, item[division.selectedIndex].groupList[i].name, item[division.selectedIndex].groupList[i]);  
        }  
        cmbSelect(group, defaultGroup);  
        changeGroup();  
        group.onchange = changeGroup;  
    }  
    function changeCategory()  
    {  
        division.options.length = 0;  
        division.onchange = null;  
        if(category.selectedIndex == -1)return;  
        var item=category.options[category.selectedIndex].obj;  
        for(var i=0;i<item.Alldivision.length;i++)  
        {  
            cmbAddOption(division,item.Alldivision[i].name,item.Alldivision);  
        }  
        cmbSelect(division,defaultDivision);  
        changeDivision();  
        division.onchange=changeDivision;  
    }  
          
          
          
          
    for(var i=0; i<categoryList.length; i++)  
    {  
        cmbAddOption(category, categoryList[i]._category, categoryList[i]);  
    }  
      
    cmbSelect(category, defaultCategory);  
    changeCategory();  
    category.onchange = changeCategory;  
}  
  
var categoryList = [  
{_category:"A 农、林、牧、渔业",Alldivision:[  
  
{name:'01 农业', groupList:[           
{name:'011 谷物种植', sectionList:['0111 稻谷种植','0112 小麦种植','0113 玉米种植','0119 其他谷物种植']},          
{name:'012 豆类、油料和薯类种植', sectionList:['0121 豆类种植','0122 油料种植','0123 薯类种植']},          
{name:'013 棉、麻、糖、烟草种植', sectionList:['0131 棉花种植','0132 麻类种植','0133 糖料种植','0134 烟草种植']},          
{name:'014 蔬菜、食用菌及园艺作物种植', sectionList:['0141 蔬菜种植','0142 食用菌种植','0143 花卉种植','0149 其他园艺作物种植']},             
{name:'015 水果种植', sectionList:['0151 仁果类和核果类水果种植','0152 葡萄种植','0153 柑橘类种植','0154 香蕉等亚热带水果种植','0159 其他水果种植']},            
{name:'016 坚果、含油果、香料和饮料作物种', sectionList:['0161 坚果种植','0162 含油果种植','0163 香料作物种植','0169 茶及其他饮料作物种植']},          
{name:'017 中药材种植', sectionList:['0170 中药材种植']},          
{name:'019 其他农业', sectionList:['0190 其他农业']}          
]},  
  
{name:'02 林业', groupList:[           
{name:'021 林木育种和育苗', sectionList:['0211 林木育种','0212 林木育苗']},           
{name:'022 造林和更新', sectionList:['0220 造林和更新']},          
{name:'023 森林经营和管护', sectionList:['0230 森林经营和管护']},            
{name:'024 木材和竹材采运', sectionList:['0241 木材采运','0242 竹材采运']},           
{name:'025 林产品采集', sectionList:['0251 木竹材林产品采集','0252 非木竹材林产品采集']}          
]},  
  
{name:'03 畜牧业', groupList:[           
{name:'031 牲畜饲养', sectionList:['0311 牛的饲养','0312 马的饲养','0313 猪的饲养','0314 羊的饲养','0315 骆驼饲养','0319 其他牲畜饲养']},            
{name:'032 家禽饲养', sectionList:['0321 鸡的饲养','0322 鸭的饲养','0323 鹅的饲养','0329 其他家禽饲养']},            
{name:'033 狩猎和捕捉动物', sectionList:['0330 狩猎和捕捉动物']},           
{name:'039 其他畜牧业', sectionList:['0390 其他畜牧业']} 
]},  
  
{name:'04 渔业', groupList:[           
{name:'041 水产养殖', sectionList:['0411 海水养殖','0412 内陆养殖']},            
{name:'042 水产捕捞', sectionList:['0421 海水捕捞','0422 内陆捕捞']}
]},  
  
{name:'05 农、林、牧、渔服务业', groupList:[           
{name:'051 农业服务业', sectionList:['0511 农业机械服务','0512 灌溉服务','0513 农产品初加工服务','0519 其他农业服务']},            
{name:'052 林业服务业', sectionList:['0521 林业有害生物防治服务','0522 森林防火服务','0523 林产品初级加工服务','0529 其他林业服务']},          
{name:'053 畜牧服务业', sectionList:['0530 畜牧服务业']},            
{name:'054 渔业服务业', sectionList:['0540 渔业服务业']},          
]},    
]  
},  
  
  
{_category:"B 采矿业",Alldivision:[  
  
{name:'06 煤炭开采和洗选业', groupList:[           
{name:'061 烟煤和无烟煤开采洗选', sectionList:['0610 烟煤和无烟煤开采洗选']},          
{name:'062 褐煤开采洗选', sectionList:['0620 褐煤开采洗选']},          
{name:'069 其他煤炭采选', sectionList:['0690 其他煤炭采选']}
]},  
  
{name:'07 石油和天然气开采业', groupList:[           
{name:'071 石油开采', sectionList:['0710 石油开采']},             
{name:'072 天然气开采', sectionList:['0720 天然气开采']}
]},  
  
{name:'08 黑色金属矿采选业', groupList:[           
{name:'081 铁矿采选', sectionList:['0810 铁矿采选']},          
{name:'082 锰矿、铬矿采选', sectionList:['0820 锰矿、铬矿采选']},          
{name:'089 其他黑色金属矿采选', sectionList:['0890 其他黑色金属矿采选']}  
]},
{name:'09 有色金属矿采选业', groupList:[           
{name:'091 常用有色金属矿采选', sectionList:['0911 铜矿采选','0912 铅锌矿采选','0913 镍钴矿采选','0914 锡矿采选','0915 锑矿采选','0916 铝矿采选','0917 镁矿采选','0919 其他常用有色金属矿采选']},          
{name:'092 贵金属矿采选', sectionList:['0921 金矿采选','0922 银矿采选','0929 其他贵金属矿采选']},          
{name:'093 稀有稀土金属矿采选', sectionList:['0931 钨钼矿采选','0932 稀土金属矿采选','0933 放射性金属矿采选','0939 其他稀有金属矿采选']}  
]},
{name:'10 非金属矿采选业', groupList:[           
{name:'101 土砂石开采', sectionList:['1011 石灰石、石膏开采','1012 建筑装饰用石开采','1013 耐火土石开采','1019 粘土及其他土砂石开采']},             
{name:'102 化学矿开采', sectionList:['1020 化学矿开采']},          
{name:'103 采盐', sectionList:['1030 采盐']},
{name:'109 石棉及其他非金属矿采选', sectionList:['1091 石棉、云母矿采选','1092 石墨、滑石采选','1093 宝石、玉石采选','1099 其他未列明非金属矿采选']}  
]}, 
{name:'11 开采辅助活动', groupList:[           
{name:'111 煤炭开采和洗选辅助活动', sectionList:['1110 煤炭开采和洗选辅助活动']},             
{name:'112 石油和天然气开采辅助活动', sectionList:['1120 石油和天然气开采辅助活动']},          
{name:'119 其他开采辅助活动', sectionList:['1190 其他开采辅助活动']}
]},
{name:'12 其他采矿业', groupList:[           
{name:'120 其他采矿业', sectionList:['1200 其他采矿业']}
]}
]  
},  
  
  
{_category:"C 制造业",Alldivision:[  
  
  
{name:'13 农副食品加工业', groupList:[           
{name:'131 谷物磨制', sectionList:['1310 谷物磨制']},           
{name:'132 饲料加工', sectionList:['1320 饲料加工']},            
{name:'133 植物油加工', sectionList:['1331 食用植物油加工','1332 非食用植物油加工']},             
{name:'134 制糖业', sectionList:['1340 制糖业']},             
{name:'135 屠宰及肉类加工', sectionList:['1351 牲畜屠宰','1352 禽类屠宰','1353 肉制品及副产品加工']},           
{name:'136 水产品加工', sectionList:['1361 水产品冷冻加工','1362 鱼糜制品及水产品干腌制加工','1363 水产饲料制造','1364 鱼油提取及制品制造','1369 其他水产品加工']},           
{name:'137 蔬菜、水果和坚果加工', sectionList:['1371 蔬菜加工','1372 水果和坚果加工']},            
{name:'139 其他农副食品加工', sectionList:['1391 淀粉及淀粉制品制造','1392 豆制品制造','1393 蛋品加工','1399 其他未列明农副食品加工']}
]},  
  
{name:'14 食品制造业', groupList:[           
{name:'141 焙烤食品制造', sectionList:['1411 糕点、面包制造','1419 饼干及其他焙烤食品制造']},            
{name:'142 糖果、巧克力及蜜饯制造', sectionList:['1421 糖果、巧克力制造','1422 蜜饯制作']},            
{name:'143 方便食品制造', sectionList:['1431 米、面制品制造','1432 速冻食品制造','1439 方便面及其他方便食品制造']},            
{name:'144 乳制品制造', sectionList:['1440 乳制品制造']},          
{name:'145 罐头食品制造', sectionList:['1451 肉、禽类罐头制造','1452 水产品罐头制造','1453 蔬菜、水果罐头制造','1459 其他罐头食品制造']},          
{name:'146 调味品、发酵制品制造', sectionList:['1461 味精制造','1462 酱油、食醋及类似制品制造','1469 其他调味品、发酵制品制造']},           
{name:'149 其他食品制造', sectionList:['1491 营养食品制造','1492 保健食品制造','1493 冷冻饮品及食用冰制造','1494 盐加工','1495 食品及饲料添加剂制造','1499 其他未列明食品制造']}
]},  
  
{name:'15 酒、饮料和精制茶制造业', groupList:[           
{name:'151 酒的制造', sectionList:['1511 酒精制造','1512 白酒制造','1513 啤酒制造','1514 黄酒制造','1515 葡萄酒制造','1519 其他酒制造']},            
{name:'152 饮料制造', sectionList:['1521 碳酸饮料制造','1522 瓶（罐）装饮用水制造','1523 果菜汁及果菜汁饮料制造','1524 含乳饮料和植物蛋白饮料制造','1525 固体饮料制造','1529 茶饮料及其他饮料制造']},            
{name:'153 精制茶加工', sectionList:['1530 精制茶加工']}
]},  
  
{name:'16 烟草制品业', groupList:[           
{name:'161 烟叶复烤', sectionList:['1610 烟叶复烤']},          
{name:'162 卷烟制造', sectionList:['1620 卷烟制造']},             
{name:'169 其他烟草制品制造', sectionList:['1690 其他烟草制品制造']} 
]},
{name:'17 纺织业', groupList:[           
{name:'171 棉纺织及印染精加工', sectionList:['1711 棉纺纱加工','1712 棉织造加工','1713 棉印染精加工']},           
{name:'172 毛纺织及染整精加工', sectionList:['1721 毛条和毛纱线加工','1722 毛织造加工','1723 毛染整精加工']},            
{name:'173 麻纺织及染整精加工', sectionList:['1731 麻纤维纺前加工和纺纱','1732 麻织造加工','1733 麻染整精加工']},             
{name:'174 丝绢纺织及印染精加工', sectionList:['1741 缫丝加工','1742 绢纺和丝织加工','1743 丝印染精加工']},             
{name:'175 化纤织造及印染精加工', sectionList:['1751 化纤织造加工','1752 化纤织物染整精加工']},           
{name:'176 针织或钩针编织物及其制品制造', sectionList:['1761 针织或钩针编织物织造','1762 针织或钩针编织物印染精加工','1763 针织或钩针编织品制造']},           
{name:'177 家用纺织制成品制造', sectionList:['1771 床上用品制造','1772 毛巾类制品制造','1773 窗帘、布艺类产品制造','1779 其他家用纺织制成品制造']},            
{name:'178 非家用纺织制成品制造', sectionList:['1781 非织造布制造','1782 绳、索、缆制造','1783 纺织带和帘子布制造','1784 篷、帆布制造','1789 其他非家用纺织制成品制造']}
]},
{name:'18 纺织服装、服饰业', groupList:[           
{name:'181 机织服装制造', sectionList:['1810 机织服装制造']},          
{name:'182 针织或钩针编织服装制造', sectionList:['1820 针织或钩针编织服装制造']},             
{name:'183 服饰制造', sectionList:['1830 服饰制造']} 
]},
{name:'19 皮革、毛皮、羽毛及其制品和制鞋业', groupList:[           
{name:'191 皮革鞣制加工', sectionList:['1910 皮革鞣制加工']},           
{name:'192 皮革制品制造', sectionList:['1921 皮革服装制造','1922 皮箱、包（袋）制造','1923 皮手套及皮装饰制品制造','1929 其他皮革制品制造']},            
{name:'193 毛皮鞣制及制品加工', sectionList:['1931 毛皮鞣制加工','1932 毛皮服装加工','1939 其他毛皮制品加工']},             
{name:'194 羽毛(绒)加工及制品制造', sectionList:['1941 羽毛（绒）加工','1942 羽毛（绒）制品加工']},             
{name:'195 制鞋业', sectionList:['1951 纺织面料鞋制造','1952 皮鞋制造','1953 塑料鞋制造','1954 橡胶鞋制造','1959 其他制鞋业']}
]},
{name:'20 木材加工和木、竹、藤、棕、草制品业', groupList:[           
{name:'201 木材加工', sectionList:['2011 锯材加工','2012 木片加工','2013 单板加工','2019 其他木材加工']},           
{name:'202 人造板制造', sectionList:['2021 胶合板制造','2022 纤维板制造','2023 刨花板制造','2029 其他人造板制造']},            
{name:'203 木制品制造', sectionList:['2031 建筑用木料及木材组件加工','2032 木门窗、楼梯制造','2033 地板制造','2034 木制容器制造','2039 软木制品及其他木制品制造']},             
{name:'204 竹、藤、棕、草等制品制造', sectionList:['2041 竹制品制造','2042 藤制品制造','2043 棕制品制造','2049 草及其他制品制造']}
]},
{name:'21 家具制造业', groupList:[           
{name:'211 木质家具制造', sectionList:['2110 木质家具制造']},           
{name:'212 竹、藤家具制造', sectionList:['2120 竹、藤家具制造']},            
{name:'213 金属家具制造', sectionList:['2130 金属家具制造']},             
{name:'214 塑料家具制造', sectionList:['2140 塑料家具制造']},             
{name:'219 其他家具制造', sectionList:['2190 其他家具制造']}
]},
{name:'22 造纸和纸制品业', groupList:[           
{name:'221 纸浆制造', sectionList:['2211 木竹浆制造','2212 非木竹浆制造']},           
{name:'222 造纸', sectionList:['2221 机制纸及纸板制造','2222 手工纸制造','2223 加工纸制造']},            
{name:'223 纸制品制造', sectionList:['2231 纸和纸板容器制造','2239 其他纸制品制造']}             
]},
{name:'23 印刷和记录媒介复制业', groupList:[           
{name:'231 印刷', sectionList:['2311 书、报刊印刷','2312 本册印制','2319 包装装潢及其他印刷']},           
{name:'232 装订及印刷相关服务', sectionList:['2320 装订及印刷相关服务']},            
{name:'233 记录媒介复制', sectionList:['2330 记录媒介复制']}             
]},
{name:'24 文教、工美、体育和娱乐用品制造业', groupList:[           
{name:'241 文教办公用品制造', sectionList:['2411 文具制造','2412 笔的制造','2413 教学用模型及教具制造','2414 墨水、墨汁制造','2419 其他文教办公用品制造']},           
{name:'242 乐器制造', sectionList:['2421 中乐器制造','2422 西乐器制造','2423 电子乐器制造','2429 其他乐器及零件制造']},            
{name:'243 工艺美术品制造', sectionList:['2431 雕塑工艺品制造','2432 金属工艺品制造','2433 漆器工艺品制造','2434 花画工艺品制造','2435 天然植物纤维编织工艺品制造','2436 抽纱刺绣工艺品制造','2437 地毯、挂毯制造','2438 珠宝首饰及有关物品制造','2439 其他工艺美术品制造']},             
{name:'244 体育用品制造', sectionList:['2441 球类制造','2442 体育器材及配件制造','2443 训练健身器材制造','2444 运动防护用具制造','2449 其他体育用品制造']},             
{name:'245 玩具制造', sectionList:['2450 玩具制造']},
{name:'246 游艺器材及娱乐用品制造', sectionList:['2461 露天游乐场所游乐设备制造','2462 游艺用品及室内游艺器材制造','2469 其他娱乐用品制造']}
]},
{name:'25 石油加工、炼焦和核燃料加工业', groupList:[           
{name:'251 精炼石油产品制造', sectionList:['2511 原油加工及石油制品制造','2512 人造原油制造']},           
{name:'252 炼焦', sectionList:['2520 炼焦']},            
{name:'253 2530 核燃料加工', sectionList:['253 2530 核燃料加工']}            
]},
{name:'26 化学原料和化学制品制造业', groupList:[           
{name:'261 基础化学原料制造', sectionList:['2611 无机酸制造','2612 无机碱制造','2613 无机盐制造','2614 有机化学原料制造','2619 其他基础化学原料制造']},           
{name:'262 肥料制造', sectionList:['2621 氮肥制造','2622 磷肥制造','2623 钾肥制造','2624 复混肥料制造','2625 有机肥料及微生物肥料制造','2629 其他肥料制造']},            
{name:'263 农药制造', sectionList:['2631 化学农药制造','2632 生物化学农药及微生物农药制造']},             
{name:'264 涂料、油墨、颜料及类似产品制造', sectionList:['2641 涂料制造','2642 油墨及类似产品制造','2643 颜料制造','2644 染料制造','2645 密封用填料及类似品制造']},             
{name:'265 合成材料制造', sectionList:['2651 初级形态塑料及合成树脂制造','2652 合成橡胶制造','2653 合成纤维单（聚合）体制造','2659 其他合成材料制造']},
{name:'266 专用化学产品制造', sectionList:['2661 化学试剂和助剂制造','2662 专项化学用品制造','2663 林产化学产品制造','2664 信息化学品制造','2665 环境污染处理专用药剂材料制造','2666 动物胶制造','2669 其他专用化学产品制造']},
{name:'267 炸药、火工及焰火产品制造', sectionList:['2671 炸药及火工产品制造','2672 焰火、鞭炮产品制造']},
{name:'268 日用化学产品制造', sectionList:['2681 肥皂及合成洗涤剂制造','2682 化妆品制造','2683 口腔清洁用品制造','2684 香料、香精制造','2689 其他日用化学产品制造']}
]},
{name:'27 医药制造业', groupList:[           
{name:'271 化学药品原料药制造', sectionList:['2710 化学药品原料药制造']},           
{name:'272 化学药品制剂制造', sectionList:['2720 化学药品制剂制造']},            
{name:'273 中药饮片加工', sectionList:['2730 中药饮片加工']},             
{name:'274 中成药生产', sectionList:['2740 中成药生产']},             
{name:'275 兽用药品制造', sectionList:['2750 兽用药品制造']},
{name:'276 生物药品制造', sectionList:['2760 生物药品制造']},
{name:'277 卫生材料及医药用品制造', sectionList:['2770 卫生材料及医药用品制造']}
]},
{name:'28 化学纤维制造业', groupList:[           
{name:'281 纤维素纤维原料及纤维制造', sectionList:['2811 化纤浆粕制造','2812 人造纤维（纤维素纤维）制造']},           
{name:'282 合成纤维制造', sectionList:['2821 锦纶纤维制造','2822 涤纶纤维制造','2823 腈纶纤维制造','2824 维纶纤维制造','2825 丙纶纤维制造','2826 氨纶纤维制造','2829 其他合成纤维制造']}  
]},
{name:'29 橡胶和塑料制品业', groupList:[           
{name:'291 橡胶制品业', sectionList:['2911 轮胎制造','2912 橡胶板、管、带制造','2913 橡胶零件制造','2914 再生橡胶制造','2915 日用及医用橡胶制品制造','2919 其他橡胶制品制造']},           
{name:'292 塑料制品业', sectionList:['2921 塑料薄膜制造','2922 塑料板、管、型材制造','2923 塑料丝、绳及编织品制造','2924 泡沫塑料制造','2925 塑料人造革、合成革制造','2926 塑料包装箱及容器制造','2927 日用塑料制品制造','2928 塑料零件制造','2929 其他塑料制品制造']}
]},
{name:'30 非金属矿物制品业', groupList:[           
{name:'301 水泥、石灰和石膏制造', sectionList:['3011 水泥制造','3012 石灰和石膏制造']},           
{name:'302 石膏、水泥制品及类似制品制造', sectionList:['3021 水泥制品制造','3022 砼结构构件制造','3023 石棉水泥制品制造','3024 轻质建筑材料制造','3029 其他水泥类似制品制造']},            
{name:'303 砖瓦、石材等建筑材料制造', sectionList:['3031 粘土砖瓦及建筑砌块制造','3032 建筑陶瓷制品制造','3033 建筑用石加工','3034 防水建筑材料制造','3035 隔热和隔音材料制造','3039 其他建筑材料制造']},             
{name:'304 玻璃制造', sectionList:['3041 平板玻璃制造','3049 其他玻璃制造']},             
{name:'305 玻璃制品制造', sectionList:['3051 技术玻璃制品制造','3052 光学玻璃制造','3053 玻璃仪器制造','3054 日用玻璃制品制造','3055 玻璃包装容器制造','3056 玻璃保温容器制造','3057 制镜及类似品加工','3059 其他玻璃制品制造']},
{name:'306 玻璃纤维和玻璃纤维增强塑料制品制造', sectionList:['3061 玻璃纤维及制品制造','3062 玻璃纤维增强塑料制品制造']},
{name:'307 陶瓷制品制造', sectionList:['3071 卫生陶瓷制品制造','3072 特种陶瓷制品制造','3073 日用陶瓷制品制造','3073 园林、陈设艺术及其他陶瓷制品制造']},
{name:'308 耐火材料制品制造', sectionList:['3081 石棉制品制造','3082 云母制品制造','3089 耐火陶瓷制品及其他耐火材料制造']},
{name:'309 石墨及其他非金属矿物制品制造', sectionList:['3091 石墨及碳素制品制造','3099 其他非金属矿物制品制造']},
]},
{name:'31 黑色金属冶炼和压延加工业', groupList:[           
{name:'311 3110 炼铁', sectionList:['311 3110 炼铁']},           
{name:'312 3120 炼钢', sectionList:['312 3120 炼钢']},            
{name:'313 3130 黑色金属铸造', sectionList:['313 3130 黑色金属铸造']},             
{name:'314 3140 钢压延加工', sectionList:['314 3140 钢压延加工']},             
{name:'315 3150 铁合金冶炼', sectionList:['315 3150 铁合金冶炼']}
]},
{name:'32 有色金属冶炼和压延加工业', groupList:[           
{name:'321 常用有色金属冶炼', sectionList:['3211 铜冶炼','3212 铅锌冶炼','3213 镍钴冶炼','3214 锡冶炼','3215 锑冶炼','3216 铝冶炼','3217 镁冶炼','3219 其他常用有色金属冶炼']},           
{name:'322 贵金属冶炼', sectionList:['3221 金冶炼','3222 银冶炼','3229 其他贵金属冶炼']},            
{name:'323 稀有稀土金属冶炼', sectionList:['3231 钨钼冶炼','3232 稀土金属冶炼','3239 其他稀有金属冶炼']},             
{name:'324 有色金属合金制造', sectionList:['3240 有色金属合金制造']},             
{name:'325 有色金属铸造', sectionList:['3250 有色金属铸造']},
{name:'326 有色金属压延加工', sectionList:['3261 铜压延加工','3262 铝压延加工','3263 贵金属压延加工','3264 稀有稀土金属压延加工','3269 其他有色金属压延加工']}
]},
{name:'33 金属制品业', groupList:[           
{name:'331 结构性金属制品制造', sectionList:['3311 金属结构制造','3312 金属门窗制造']},           
{name:'332 金属工具制造', sectionList:['3321 切削工具制造','3322 手工具制造','3323 农用及园林用金属工具制造','3324 刀剪及类似日用金属工具制造','3329 其他金属工具制造']},            
{name:'333 集装箱及金属包装容器制造', sectionList:['3331 集装箱制造','3332 金属压力容器制造','3333 金属包装容器制造']},             
{name:'334 金属丝绳及其制品制造', sectionList:['3340 金属丝绳及其制品制造']},             
{name:'335 建筑、安全用金属制品制造', sectionList:['3351 建筑、家具用金属配件制造','3352 建筑装饰及水暖管道零件制造','3353 安全、消防用金属制品制造','3359 其他建筑、安全用金属制品制造']},
{name:'336 金属表面处理及热处理加工', sectionList:['3360 金属表面处理及热处理加工']},
{name:'337 搪瓷制品制造', sectionList:['3371 生产专用搪瓷制品制造','3372 建筑装饰搪瓷制品制造','3373 搪瓷卫生洁具制造','3379 搪瓷日用品及其他搪瓷制品制造']},
{name:'338 金属制日用品制造', sectionList:['3381 金属制厨房用器具制造','3382 金属制餐具和器皿制造','3383 金属制卫生器具制造','3389 其他金属制日用品制造']},   
{name:'339 其他金属制品制造', sectionList:['3391 锻件及粉末冶金制品制造','3392 交通及公共管理用金属标牌制造','3399 其他未列明金属制品制造']}
]},
{name:'34 通用设备制造业', groupList:[           
{name:'341 锅炉及原动设备制造', sectionList:['3411 锅炉及辅助设备制造','3412 内燃机及配件制造','3413 汽轮机及辅机制造','3414 水轮机及辅机制造','3415 风能原动设备制造','3419 其他原动设备制造']},           
{name:'342 金属加工机械制造', sectionList:['3421 金属切削机床制造','3422 金属成形机床制造','3423 铸造机械制造','3424 金属切割及焊接设备制造','3425 机床附件制造','3429 其他金属加工机械制造']},            
{name:'343 物料搬运设备制造', sectionList:['3431 轻小型起重设备制造','3432 起重机制造','3433 生产专用车辆制造','3434 连续搬运设备制造','3435 电梯、自动扶梯及升降机制造','3439 其他物料搬运设备制造']},             
{name:'344 泵、阀门、压缩机及类似机械制造', sectionList:['3441 泵及真空设备制造','3442 气体压缩机械制造','3443 阀门和旋塞制造','3444 液压和气压动力机械及元件制造']},             
{name:'345 轴承、齿轮和传动部件制造', sectionList:['3451 轴承制造','3452 齿轮及齿轮减、变速箱制造','3459 其他传动部件制造']},
{name:'346 烘炉、风机、衡器、包装等设备制造', sectionList:['3461 烘炉、熔炉及电炉制造','3462 风机、风扇制造','3463 气体、液体分离及纯净设备制造','3464 制冷、空调设备制造','3465 风动和电动工具制造','3466 喷枪及类似器具制造','3467 衡器制造','3468 包装专用设备制造']},
{name:'347 文化、办公用机械制造', sectionList:['3471 电影机械制造','3472 幻灯及投影设备制造','3473 照相机及器材制造','3474 复印和胶印设备制造','3475 计算器及货币专用设备制造','3479 其他文化、办公用机械制造']},
{name:'348 通用零部件制造', sectionList:['3481 金属密封件制造','3482 紧固件制造','3483 弹簧制造','3484 机械零部件加工','3489 其他通用零部件制造']},
{name:'349 其他通用设备制造业', sectionList:['3490 其他通用设备制造业']}
]},
{name:'35 专用设备制造业', groupList:[           
{name:'351 采矿、冶金、建筑专用设备制造', sectionList:['3511 矿山机械制造','3512 石油钻采专用设备制造','3513 建筑工程用机械制造','3514 海洋工程专用设备制造','3515 建筑材料生产专用机械制造','3516 冶金专用设备制造']},           
{name:'352 化工、木材、非金属加工专用设备制造', sectionList:['3521 炼油、化工生产专用设备制造','3522 橡胶加工专用设备制造','3523 塑料加工专用设备制造','3524 木材加工机械制造','3525 模具制造','3529 其他非金属加工专用设备制造']},            
{name:'353 食品、饮料、烟草及饲料生产专用设备制造', sectionList:['3531 食品、酒、饮料及茶生产专用设备制造','3532 农副食品加工专用设备制造','3533 烟草生产专用设备制造','3534 饲料生产专用设备制造']},             
{name:'354 印刷、制药、日化及日用品生产专用设备制造', sectionList:['3541 制浆和造纸专用设备制造','3542 印刷专用设备制造','3543 日用化工专用设备制造','3544 制药专用设备制造','3545 照明器具生产专用设备制造','3546 玻璃、陶瓷和搪瓷制品生产专用设备制造','3549 其他日用品生产专用设备制造']},             
{name:'355 纺织、服装和皮革加工专用设备制造', sectionList:['3551 纺织专用设备制造','3552 皮革、毛皮及其制品加工专用设备制造','3553 缝制机械制造','3554 洗涤机械制造']},
{name:'356 电子和电工机械专用设备制造', sectionList:['3561 电工机械专用设备制造','3562 电子工业专用设备制造']},
{name:'357 农、林、牧、渔专用机械制造', sectionList:['3571 拖拉机制造','3572 机械化农业及园艺机具制造','3573 营林及木竹采伐机械制造','3574 畜牧机械制造','3575 渔业机械制造','3576 农林牧渔机械配件制造','3577 棉花加工机械制造','3579 其他农、林、牧、渔业机械制造']},
{name:'358 医疗仪器设备及器械制造', sectionList:['3581 医疗诊断、监护及治疗设备制造','3582 口腔科用设备及器具制造','3583 医疗实验室及医用消毒设备和器具制造','3584 医疗、外科及兽医用器械制造','3585 机械治疗及病房护理设备制造','3586 假肢、人工器官及植（介）入器械制造','3589 其他医疗设备及器械制造']},
{name:'359 环保、社会公共服务及其他专用设备制造', sectionList:['3591 环境保护专用设备制造','3592 地质勘查专用设备制造','3593 邮政专用机械及器材制造','3594 商业、饮食、服务专用设备制造','3595 社会公共安全设备及器材制造','3596 交通安全、管制及类似专用设备制造','3597 水资源专用机械制造','3599 其他专用设备制造']}
]},
{name:'36 汽车制造业', groupList:[           
{name:'361 汽车整车制造', sectionList:['3610 汽车整车制造']},           
{name:'362 改装汽车制造', sectionList:['3620 改装汽车制造']},            
{name:'363 低速载货汽车制造', sectionList:['3630 低速载货汽车制造']},             
{name:'364 电车制造', sectionList:['3640 电车制造']},             
{name:'365 汽车车身、挂车制造', sectionList:['3650 汽车车身、挂车制造']},
{name:'366 汽车零部件及配件制造', sectionList:['3660 汽车零部件及配件制造']}
]},
{name:'37 铁路、船舶、航空航天和其他运输设备制造业', groupList:[           
{name:'371 铁路运输设备制造', sectionList:['3711 铁路机车车辆及动车组制造','3712 窄轨机车车辆制造','3713 铁路机车车辆配件制造','3714 铁路专用设备及器材、配件制造','3719 其他铁路运输设备制造']},           
{name:'372 城市轨道交通设备制造', sectionList:['3720 城市轨道交通设备制造']},            
{name:'373 船舶及相关装置制造', sectionList:['3731 金属船舶制造','3732 非金属船舶制造','3733 娱乐船和运动船制造','3734 船用配套设备制造','3735 船舶改装与拆除','3739 航标器材及其他相关装置制造']},             
{name:'374 航空、航天器及设备制造', sectionList:['3741 飞机制造','3742 航天器制造','3743 航空、航天相关设备制造','3749 其他航空航天器制造']},             
{name:'375 摩托车制造', sectionList:['3751 摩托车整车制造','3752 摩托车零部件及配件制造']},
{name:'376 自行车制造', sectionList:['3761 脚踏自行车及残疾人座车制造','3762 助动自行车制造']},
{name:'377 非公路休闲车及零配件制造', sectionList:['3770 非公路休闲车及零配件制造']},
{name:'379 潜水救捞及其他未列明运输设备制造', sectionList:['3791 潜水及水下救捞装备制造','3799 其他未列明运输设备制造']},
]},
{name:'38 电气机械和器材制造业', groupList:[           
{name:'381 电机制造', sectionList:['3811 发电机及发电机组制造','3812 电动机制造','3819 微电机及其他电机制造']},           
{name:'382 输配电及控制设备制造', sectionList:['3821 变压器、整流器和电感器制造','3822 电容器及其配套设备制造','3823 配电开关控制设备制造','3824 电力电子元器件制造','3825 光伏设备及元器件制造','3829 其他输配电及控制设备制造']},            
{name:'383 电线、电缆、光缆及电工器材制造', sectionList:['3831 电线、电缆制造','3832 光纤、光缆制造','3833 绝缘制品制造','3839 其他电工器材制造']},             
{name:'384 电池制造', sectionList:['3841 锂离子电池制造','3842 镍氢电池制造','3849 其他电池制造']},             
{name:'385 家用电力器具制造', sectionList:['3851 家用制冷电器具制造','3852 家用空气调节器制造','3853 家用通风电器具制造','3854 家用厨房电器具制造','3855 家用清洁卫生电器具制造','3856 家用美容、保健电器具制造','3857 家用电力器具专用配件制造','3859 其他家用电力器具制造']},
{name:'386 非电力家用器具制造', sectionList:['3861 燃气、太阳能及类似能源家用器具制造','3869 其他非电力家用器具制造']},
{name:'387 照明器具制造', sectionList:['3871 电光源制造','3872 照明灯具制造','3879 灯用电器附件及其他照明器具制造']},
{name:'389 其他电气机械及器材制造', sectionList:['3891 电气信号设备装置制造','3899 其他未列明电气机械及器材制造']},
]},
{name:'39 计算机、通信和其他电子设备制造业', groupList:[           
{name:'391 计算机制造', sectionList:['3911 计算机整机制造','3912 计算机零部件制造','3913 计算机外围设备制造','3919 其他计算机制造']},           
{name:'392 通信设备制造', sectionList:['3921 通信系统设备制造','3922 通信终端设备制造']},            
{name:'393 广播电视设备制造', sectionList:['3931 广播电视节目制作及发射设备制造','3932 广播电视接收设备及器材制造','3939 应用电视设备及其他广播电视设备制造']},             
{name:'394 雷达及配套设备制造', sectionList:['3940 雷达及配套设备制造']},             
{name:'395 视听设备制造', sectionList:['3951 电视机制造','3952 音响设备制造','3953 影视录放设备制造']},
{name:'396 电子器件制造', sectionList:['3961 电子真空器件制造','3962 半导体分立器件制造','3963 集成电路制造','3969 光电子器件及其他电子器件制造']},
{name:'397 电子元件制造', sectionList:['3971 电子元件及组件制造','3972 印制电路板制造']},
{name:'399 其他电子设备制造', sectionList:['3990 其他电子设备制造']},
]},
{name:'40 仪器仪表制造业', groupList:[           
{name:'401 通用仪器仪表制造', sectionList:['4011 工业自动控制系统装置制造','4012 电工仪器仪表制造','4013 绘图、计算及测量仪器制造','4014 实验分析仪器制造','4015 试验机制造','4019 供应用仪表及其他通用仪器制造']},           
{name:'402 专用仪器仪表制造', sectionList:['4021 环境监测专用仪器仪表制造','4022 运输设备及生产用计数仪表制造','4023 导航、气象及海洋专用仪器制造','4024 农林牧渔专用仪器仪表制造','4025 地质勘探和地震专用仪器制造','4026 教学专用仪器制造','4027 核子及核辐射测量仪器制造','4028 电子测量仪器制造','4029 其他专用仪器制造']},            
{name:'403 钟表与计时仪器制造', sectionList:['4030 钟表与计时仪器制造']},             
{name:'404 光学仪器及眼镜制造', sectionList:['4041 光学仪器制造','4042 眼镜制造']},             
{name:'409 其他仪器仪表制造业', sectionList:['4090 其他仪器仪表制造业']}
]},
{name:'41 其他制造业', groupList:[           
{name:'411 日用杂品制造', sectionList:['4111 鬃毛加工、制刷及清扫工具制造','4119 其他日用杂品制造']},           
{name:'412 煤制品制造', sectionList:['4120 煤制品制造']},            
{name:'413 核辐射加工', sectionList:['4130 核辐射加工']},             
{name:'419 其他未列明制造业', sectionList:['4190 其他未列明制造业']}
]},
{name:'42 废弃资源综合利用业', groupList:[           
{name:'421 金属废料和碎屑加工处理', sectionList:['4210 金属废料和碎屑加工处理']},           
{name:'422 非金属废料和碎屑加工处理', sectionList:['4220 非金属废料和碎屑加工处理']}
]},  
{name:'43 金属制品、机械和设备修理业', groupList:[           
{name:'431 金属制品修理', sectionList:['4310 金属制品修理']},           
{name:'432 通用设备修理', sectionList:['4320 通用设备修理']},            
{name:'433 专用设备修理', sectionList:['4330 专用设备修理']},             
{name:'434 铁路、船舶、航空航天等运输设备修理', sectionList:['4341 铁路运输设备修理','4342 船舶修理','4343 航空航天器修理','4349 其他运输设备修理']},
{name:'435 电气设备修理', sectionList:['4350 电气设备修理']},     
{name:'436 仪器仪表修理', sectionList:['4360 仪器仪表修理']},     
{name:'439 其他机械和设备修理业', sectionList:['4390 其他机械和设备修理业']}     
]}  
  
  
]  
},   
{_category:"D 电力、热力、燃气及水生产和供应业",Alldivision:[  
{name:'44 电力、热力生产和供应业', groupList:[           
{name:'441 电力生产', sectionList:['4411 火力发电','4412 水力发电','4413 核力发电','4414 风力发电','4415 太阳能发电','4419 其他电力生产']},          
{name:'442 电力供应', sectionList:['4420 电力供应']},          
{name:'443 热力生产和供应', sectionList:['4430 热力生产和供应']}
]},  
  
{name:'45 燃气生产和供应业', groupList:[           
{name:'450 燃气生产和供应业', sectionList:['4500 燃气生产和供应业']}
]},  
  
{name:'46 水的生产和供应业', groupList:[          
{name:'461 自来水生产和供应', sectionList:['4610 自来水生产和供应']},            
{name:'462 污水处理及其再生利用', sectionList:['4620 污水处理及其再生利用']},          
{name:'469 其他水的处理、利用与分配', sectionList:['4690 其他水的处理、利用与分配']}
]}  
  
  
]  
},  
  
  
{_category:"E 建筑业",Alldivision:[  
  
{name:'47 房屋建筑业', groupList:[           
{name:'470 房屋建筑业', sectionList:['4700 房屋建筑业']}
]},  
  
{name:'48 土木工程建筑业', groupList:[           
{name:'481 铁路、道路、隧道和桥梁工程建筑', sectionList:['4811 铁路工程建筑','4812 公路工程建筑','4813 市政道路工程建筑','4819 其他道路、隧道和桥梁工程建']},             
{name:'482 水利和内河港口工程建筑', sectionList:['4821 水源及供水设施工程建筑','4822 河湖治理及防洪设施工程建筑','4823 港口及航运设施工程建筑']},           
{name:'483 海洋工程建筑', sectionList:['4830 海洋工程建筑']},          
{name:'484 工矿工程建筑', sectionList:['4840 工矿工程建筑']},           
{name:'485 架线和管道工程建筑', sectionList:['4851 架线及设备工程建筑','4852 管道工程建筑']},           
{name:'489 其他土木工程建筑', sectionList:['4890 其他土木工程建筑']}
]},  
{name:'49 建筑安装业', groupList:[           
{name:'491 电气安装', sectionList:['4910 电气安装']},          
{name:'492 管道和设备安装', sectionList:['4920 管道和设备安装']},            
{name:'499 其他建筑安装业', sectionList:['4990 其他建筑安装业']}
]},  
{name:'50 建筑装饰和其他建筑业', groupList:[           
{name:'501 建筑装饰业', sectionList:['5010 建筑装饰业']},            
{name:'502 工程准备活动', sectionList:['5021 建筑物拆除活动','5029 其他工程准备活动']},          
{name:'503 提供施工设备服务', sectionList:['5030 提供施工设备服务']},          
{name:'509 其他未列明建筑业', sectionList:['5090 其他未列明建筑业']}
]}
]  
},  
  
{_category:"F 批发和零售业",Alldivision:[  
  
{name:'51 批发业', groupList:[           
{name:'511 农、林、牧产品批发', sectionList:['5111 谷物、豆及薯类批发','5112 种子批发','5113 饲料批发','5114 棉、麻批发','5115 林业产品批发','5116 牲畜批发','5119 其他农牧产品批发']},             
{name:'512 食品、饮料及烟草制品批发', sectionList:['5121 米、面制品及食用油批发','5122 糕点、糖果及糖批发','5123 果品、蔬菜批发','5124 肉、禽、蛋、奶及水产品批发','5125 盐及调味品批发','5126 营养和保健品批发','5127 酒、饮料及茶叶批发','5128 烟草制品批发','5129 其他食品批发']},             
{name:'513 纺织、服装及家庭用品批发', sectionList:['5131 纺织品、针织品及原料批发','5132 服装批发','5133 鞋帽批发','5134 化妆品及卫生用品批发','5135 厨房、卫生间用具及日用杂货批发','5136 灯具、装饰物品批发','5137 家用电器批发','5139 其他家庭用品批发']},           
{name:'514 文化、体育用品及器材批发', sectionList:['5141 文具用品批发','5142 体育用品及器材批发','5143 图书批发','5144 报刊批发','5145 音像制品及电子出版物批发','5146 首饰、工艺品及收藏品批发','5149 其他文化用品批发']},           
{name:'515 医药及医疗器材批发', sectionList:['5151 西药批发','5152 中药批发','5153 医疗用品及器材批发']},          
{name:'516 矿产品、建材及化工产品批发', sectionList:['5161 煤炭及制品批发','5162 石油及制品批发','5163 非金属矿及制品批发','5164 金属及金属矿批发','5165 建材批发','5166 化肥批发','5167 农药批发','5168 农用薄膜批发','5169 其他化工产品批发']},            
{name:'517 机械设备、五金产品及电子产品批发', sectionList:['5171 农业机械批发','5172 汽车批发','5173 汽车零配件批发','5174 摩托车及零配件批发','5175 五金产品批发','5176 电气设备批发','5177 计算机、软件及辅助设备批发','5178 通讯及广播电视设备批发','5179 其他机械设备及电子产品批发']},            
{name:'518 贸易经纪与代理', sectionList:['5181 贸易代理','5182 拍卖','5189 其他贸易经纪与代理']},            
{name:'519 其他批发业', sectionList:['5191 再生物资回收与批发','5199 其他未列明批发业']}
]},  
{name:'52 零售业', groupList:[           
{name:'521 综合零售', sectionList:['5211 百货零售','5212 超级市场零售','5219 其他综合零售']},          
{name:'522 食品、饮料及烟草制品专门零售', sectionList:['5221 粮油零售','5222 糕点、面包零售','5223 果品、蔬菜零售','5224 肉、禽、蛋、奶及水产品零售','5225 营养和保健品零售','5226 酒、饮料及茶叶零售','5227 烟草制品零售','5229 其他食品零售']},          
{name:'523 纺织、服装及日用品专门零售', sectionList:['5231 纺织品及针织品零售','5232 服装零售','5233 鞋帽零售','5234 化妆品及卫生用品零售','5235 钟表、眼镜零售','5236 箱、包零售','5237 厨房用具及日用杂品零售','5238 自行车零售','5239 其他日用品零售']},           
{name:'524 文化、体育用品及器材专门零售', sectionList:['5241 文具用品零售','5242 体育用品及器材零售','5243 图书、报刊零售','5244 音像制品及电子出版物零售','5245 珠宝首饰零售','5246 工艺美术品及收藏品零售','5247 乐器零售','5248 照相器材零售','5249 其他文化用品零售']},             
{name:'525 医药及医疗器材专门零售', sectionList:['5251 药品零售','5252 医疗用品及器材零售']},          
{name:'526 汽车、摩托车、燃料及零配件专门零售', sectionList:['5261 汽车零售','5262 汽车零配件零售','5263 摩托车及零配件零售','5264 机动车燃料零售']},            
{name:'527 家用电器及电子产品专门零售', sectionList:['5271 家用视听设备零售','5272 日用家电设备零售','5273 计算机、软件及辅助设备零售','5274 通信设备零售','5279 其他电子产品零售']},           
{name:'528 五金、家具及室内装饰材料专门零售', sectionList:['5281 五金零售','5282 灯具零售','5283 家具零售','5284 涂料零售','5285 卫生洁具零售','5286 木质装饰材料零售','5287 陶瓷、石材装饰材料零售','5289 其他室内装饰材料零售']},             
{name:'529 货摊、无店铺及其他零售业', sectionList:['5291 货摊食品零售','5292 货摊纺织、服装及鞋零售','5293 货摊日用品零售','5294 互联网零售','5295 邮购及电视、电话零售','5296 旧货零售','5297 生活用燃料零售','5299 其他未列明零售业']}  
]}
]  
},  
  
{_category:"G 交通运输、仓储和邮政业",Alldivision:[  
  
{name:'53 铁路运输业', groupList:[           
{name:'531 铁路旅客运输', sectionList:['5310 铁路旅客运输']},          
{name:'532 铁路货物运输', sectionList:['5320 铁路货物运输']},             
{name:'533 铁路运输辅助活动', sectionList:['5331 客运火车站','5332 货运火车站','5339 其他铁路运输辅助活动']}
]},  
{name:'54 道路运输业', groupList:[           
{name:'541 城市公共交通运输', sectionList:['5411 公共电汽车客运','5412 城市轨道交通','5413 出租车客运','5419 其他城市公共交通运输']},          
{name:'542 公路旅客运输', sectionList:['5420 公路旅客运输']},            
{name:'543 道路货物运输', sectionList:['5430 道路货物运输']},             
{name:'544 道路运输辅助活动', sectionList:['5441 客运汽车站','5442 公路管理与养护','5449 其他道路运输辅助活动']}
]},  
{name:'55 水上运输业', groupList:[          
{name:'551 水上旅客运输', sectionList:['5511 海洋旅客运输','5512 内河旅客运输','5513 客运轮渡运输']},           
{name:'552 水上货物运输', sectionList:['5521 远洋货物运输','5522 沿海货物运输','5523 内河货物运输']},           
{name:'553 水上运输辅助活动', sectionList:['5531 客运港口','5532 货运港口','5539 其他水上运输辅助活动']}
]},
{name:'56 航空运输业', groupList:[          
{name:'561 航空客货运输', sectionList:['5611 航空旅客运输','5612 航空货物运输']},           
{name:'562 通用航空服务', sectionList:['5620 通用航空服务']},           
{name:'563 航空运输辅助活动', sectionList:['5631 机场','5632 空中交通管理','5639 其他航空运输辅助活动']}
]},  
{name:'57 管道运输业', groupList:[          
{name:'570 管道运输业', sectionList:['5700 管道运输业']}
]},
{name:'58 装卸搬运和运输代理业', groupList:[          
{name:'581 装卸搬运', sectionList:['5810 装卸搬运']},           
{name:'582 运输代理业', sectionList:['5821 货物运输代理','5822 旅客票务代理','5829 其他运输代理业']}
]},  
{name:'59 仓储业', groupList:[          
{name:'591 谷物、棉花等农产品仓储', sectionList:['5911 谷物仓储','5912 棉花仓储','5919 其他农产品仓储']},
{name:'599 其他仓储业', sectionList:['5990 其他仓储业']}
]}, 
{name:'60 邮政业', groupList:[          
{name:'601 邮政基本服务', sectionList:['6010 邮政基本服务']},
{name:'602 快递服务', sectionList:['6020 快递服务']}
]}
]  
},
{_category:"H 住宿和餐饮业",Alldivision:[  
  
{name:'61 住宿业', groupList:[           
{name:'611 旅游饭店', sectionList:['6110 旅游饭店']},          
{name:'612 一般旅馆', sectionList:['6120 一般旅馆']},             
{name:'619 其他住宿业', sectionList:['6190 其他住宿业']}
]},  
{name:'62 餐饮业', groupList:[           
{name:'621 正餐服务', sectionList:['6210 正餐服务']},          
{name:'622 快餐服务', sectionList:['6220 快餐服务']},            
{name:'623 饮料及冷饮服务', sectionList:['6231 茶馆服务','6232 咖啡馆服务','6233 酒吧服务','6239 其他饮料及冷饮服务']},             
{name:'629 其他餐饮业', sectionList:['6291 小吃服务','6292 餐饮配送服务','6299 其他未列明餐饮业']}
]}
  
]  
},
{_category:"I 信息传输、软件和信息技术服务业",Alldivision:[  
  
{name:'63 电信、广播电视和卫星传输服务', groupList:[           
{name:'631 电信', sectionList:['6311 固定电信服务','6312 移动电信服务','6319 其他电信服务']},          
{name:'632 广播电视传输服务', sectionList:['6321 有线广播电视传输服务','6322 无线广播电视传输服务']},             
{name:'633 卫星传输服务', sectionList:['6330 卫星传输服务']}
]},  
{name:'64 互联网和相关服务', groupList:[           
{name:'641 互联网接入及相关服务', sectionList:['6410 互联网接入及相关服务']},          
{name:'642 互联网信息服务', sectionList:['6420 互联网信息服务']},            
{name:'649 其他互联网服务', sectionList:['6490 其他互联网服务']}
]},  
{name:'65 软件和信息技术服务业', groupList:[          
{name:'651 软件开发', sectionList:['6510 软件开发']},           
{name:'652 信息系统集成服务', sectionList:['6520 信息系统集成服务']},           
{name:'653 信息技术咨询服务', sectionList:['6530 信息技术咨询服务']},           
{name:'654 数据处理和存储服务', sectionList:['6540 数据处理和存储服务']},          
{name:'655 集成电路设计', sectionList:['6550 集成电路设计']},            
{name:'659 其他信息技术服务业', sectionList:['6591 数字内容服务','6592 呼叫中心','6599 其他未列明信息技术服务业']}
]}  
]  
},
{_category:"J 金融业",Alldivision:[  
  
{name:'66 货币金融服务', groupList:[           
{name:'661 中央银行服务', sectionList:['6610 中央银行服务']},          
{name:'662 货币银行服务', sectionList:['6620 货币银行服务']},             
{name:'663 非货币银行服务', sectionList:['6631 金融租赁服务','6632 财务公司','6633 典当','6639 其他非货币银行服务']},            
{name:'664 银行监管服务', sectionList:['6640 银行监管服务']}
]},  
{name:'67 资本市场服务', groupList:[           
{name:'671 证券市场服务', sectionList:['6711 证券市场管理服务','6712 证券经纪交易服务','6713 基金管理服务']},          
{name:'672 期货市场服务', sectionList:['6721 期货市场管理服务','6729 其他期货市场服务']},            
{name:'673 证券期货监管服务', sectionList:['6730 证券期货监管服务']},             
{name:'674 资本投资服务', sectionList:['6740 资本投资服务']},          
{name:'679 其他资本市场服务', sectionList:['6790 其他资本市场服务']}
]},  
{name:'68 保险业', groupList:[          
{name:'681 人身保险', sectionList:['6811 人寿保险','6812 健康和意外保险']},           
{name:'682 财产保险', sectionList:['6820 财产保险']},           
{name:'683 再保险', sectionList:['6830 再保险']},
{name:'684 养老金', sectionList:['6840 养老金']},
{name:'685 保险经纪与代理服务', sectionList:['6850 保险经纪与代理服务']},
{name:'686 保险监管服务', sectionList:['6860 保险监管服务']},
{name:'689 其他保险活动', sectionList:['6891 风险和损失评估','6899 其他未列明保险活动']},
]},
{name:'69 其他金融业', groupList:[          
{name:'691 金融信托与管理服务', sectionList:['6910 金融信托与管理服务']},           
{name:'692 控股公司服务', sectionList:['6920 控股公司服务']},           
{name:'693 非金融机构支付服务', sectionList:['6930 非金融机构支付服务']},
{name:'694 金融信息服务', sectionList:['6940 金融信息服务']},
{name:'699 其他未列明金融业', sectionList:['6990 其他未列明金融业']}
]}   
  
]  
},
{_category:"K 房地产业",Alldivision:[  
  
{name:'70 房地产业', groupList:[           
{name:'701 房地产开发经营', sectionList:['7010 房地产开发经营']},          
{name:'702 物业管理', sectionList:['7020 物业管理']},             
{name:'703 房地产中介服务', sectionList:['7030 房地产中介服务']},            
{name:'704 自有房地产经营活动', sectionList:['7040 自有房地产经营活动']},            
{name:'709 其他房地产业', sectionList:['7090 其他房地产业']}
]},    
]  
},
{_category:"L 租赁和商务服务业",Alldivision:[  
  
{name:'71 租赁业', groupList:[           
{name:'711 机械设备租赁', sectionList:['7111 汽车租赁','7112 农业机械租赁','7113 建筑工程机械与设备租赁','7114 计算机及通讯设备租赁','7119 其他机械与设备租赁']},          
{name:'712 文化及日用品出租', sectionList:['7121 娱乐及体育设备出租','7122 图书出租','7123 音像制品出租','7129 其他文化及日用品出租']}
]},  
{name:'72 商务服务业', groupList:[           
{name:'721 企业管理服务', sectionList:['7211 企业总部管理','7212 投资与资产管理','7213 单位后勤管理服务','7219 其他企业管理服务']},          
{name:'722 法律服务', sectionList:['7221 律师及相关法律服务','7222 公证服务','7229 其他法律服务']},            
{name:'723 咨询与调查', sectionList:['7231 会计、审计及税务服务','7232 市场调查','7233 社会经济咨询','7239 其他专业咨询']},             
{name:'724 广告业', sectionList:['7240 广告业']},          
{name:'725 知识产权服务', sectionList:['7250 知识产权服务']},          
{name:'726 人力资源服务', sectionList:['7261 公共就业服务','7262 职业中介服务','7263 劳务派遣服务','7269 其他人力资源服务']},            
{name:'727 旅行社及相关服务', sectionList:['7271 旅行社服务','7272 旅游管理服务','7279 其他旅行社相关服务']},            
{name:'728 安全保护服务', sectionList:['7281 安全服务','7282 安全系统监控服务','7289 其他安全保护服务']},            
{name:'729 其他商务服务业', sectionList:['7291 市场管理','7292 会议及展览服务','7293 包装服务','7294 办公服务','7295 信用服务','7296 担保服务','7299 其他未列明商务服务业']}  
]}
]  
},
{_category:"M 科学研究和技术服务业",Alldivision:[  
  
{name:'73 研究和试验发展', groupList:[           
{name:'731 自然科学研究和试验发展', sectionList:['7310 自然科学研究和试验发展']},          
{name:'732 工程和技术研究和试验发展', sectionList:['7320 工程和技术研究和试验发展']},             
{name:'733 农业科学研究和试验发展', sectionList:['7330 农业科学研究和试验发展']},            
{name:'734 医学研究和试验发展', sectionList:['7340 医学研究和试验发展']},            
{name:'735 社会人文科学研究', sectionList:['7350 社会人文科学研究']}
]},  
{name:'74 专业技术服务业', groupList:[           
{name:'741 气象服务', sectionList:['7410 气象服务']},          
{name:'742 地震服务', sectionList:['7420 地震服务']},            
{name:'743 海洋服务', sectionList:['7430 海洋服务']},             
{name:'744 测绘服务', sectionList:['7440 测绘服务']},          
{name:'745 质检技术服务', sectionList:['7450 质检技术服务']},          
{name:'746 环境与生态监测', sectionList:['7461 环境保护监测','7462 生态监测']},            
{name:'747 地质勘查', sectionList:['7471 能源矿产地质勘查','7472 固体矿产地质勘查','7473 水、二氧化碳等矿产地质勘查','7474 基础地质勘查','7475 地质勘查技术服务']},            
{name:'748 工程技术', sectionList:['7481 工程管理服务','7482 工程勘察设计','7483 规划管理']},            
{name:'749 其他专业技术服务业', sectionList:['7491 专业化设计服务','7492 摄影扩印服务','7493 兽医服务','7499 其他未列明专业技术服务业']}  
]},  
{name:'75 科技推广和应用服务业', groupList:[          
{name:'751 技术推广服务', sectionList:['7511 农业技术推广服务','7512 生物技术推广服务','7513 新材料技术推广服务','7514 节能技术推广服务','7519 其他技术推广服务']},           
{name:'752 科技中介服务', sectionList:['7520 科技中介服务']},           
{name:'759 其他科技推广和应用服务业', sectionList:['7590 其他科技推广和应用服务业']}
]}  
]  
},
{_category:"N 水利、环境和公共设施管理业",Alldivision:[  
  
{name:'76 水利管理业', groupList:[           
{name:'761 防洪除涝设施管理', sectionList:['7610 防洪除涝设施管理']},          
{name:'762 水资源管理', sectionList:['7620 水资源管理']},             
{name:'763 天然水收集与分配', sectionList:['7630 天然水收集与分配']},            
{name:'764 水文服务', sectionList:['7640 水文服务']},            
{name:'769 其他水利管理业', sectionList:['7690 其他水利管理业']}
]},  
{name:'77 生态保护和环境治理业', groupList:[           
{name:'771 生态保护', sectionList:['7711 自然保护区管理','7712 野生动物保护','7713 野生植物保护','7719 其他自然保护']},          
{name:'772 环境治理业', sectionList:['7721 水污染治理','7722 大气污染治理','7723 固体废物治理','7724 危险废物治理','7725 放射性废物治理','7729 其他污染治理']}
]},  
{name:'78 公共设施管理业', groupList:[          
{name:'781 市政设施管理', sectionList:['7810 市政设施管理']},           
{name:'782 环境卫生管理', sectionList:['7820 环境卫生管理']},           
{name:'783 城乡市容管理', sectionList:['7830 城乡市容管理']},           
{name:'784 绿化管理', sectionList:['7840 绿化管理']},          
{name:'785 公园和游览景区管理', sectionList:['7851 公园管理','7852 游览景区管理']}
]}  
]  
},
{_category:"O 居民服务、修理和其他服务业",Alldivision:[  
  
{name:'79 居民服务业', groupList:[           
{name:'791 家庭服务', sectionList:['7910 家庭服务']},          
{name:'792 托儿所服务', sectionList:['7920 托儿所服务']},             
{name:'793 洗染服务', sectionList:['7930 洗染服务']},            
{name:'794 理发及美容服务', sectionList:['7940 理发及美容服务']},            
{name:'795 洗浴服务', sectionList:['7950 洗浴服务']},          
{name:'796 保健服务', sectionList:['7960 保健服务']},          
{name:'797 婚姻服务', sectionList:['7970 婚姻服务']},            
{name:'798 殡葬服务', sectionList:['7980 殡葬服务']},            
{name:'799 其他居民服务业', sectionList:['7990 其他居民服务业']}
]},  
{name:'80 机动车、电子产品和日用产品修理业', groupList:[           
{name:'801 汽车、摩托车修理与维护', sectionList:['8011 汽车修理与维护','8012 摩托车修理与维护']},          
{name:'802 计算机和办公设备维修', sectionList:['8021 计算机和辅助设备修理','8022 通讯设备修理','8029 其他办公设备维修']},            
{name:'803 家用电器修理', sectionList:['8031 家用电子产品修理','8032 日用电器修理']},             
{name:'809 其他日用产品修理业', sectionList:['8091 自行车修理','8092 鞋和皮革修理','8093 家具和相关物品修理','8099 其他未列明日用产品修理业']}
]},  
{name:'81 其他服务业', groupList:[          
{name:'811 清洁服务', sectionList:['8111 建筑物清洁服务','8119 其他清洁服务']},           
{name:'819 其他未列明服务业', sectionList:['8190 其他未列明服务业']}
]}  
]  
},
{_category:"P 教育",Alldivision:[   
{name:'82 教育', groupList:[           
{name:'821 8210 学前教育', sectionList:['821 8210 学前教育']},          
{name:'822 初等教育', sectionList:['8221 普通小学教育','8222 成人小学教育']},             
{name:'823 中等教育', sectionList:['8231 普通初中教育','8232 职业初中教育','8233 成人初中教育','8234 普通高中教育','8235 成人高中教育','8236 中等职业学校教育']},            
{name:'824 高等教育', sectionList:['8241 普通高等教育','8242 成人高等教育']},            
{name:'825 特殊教育', sectionList:['8250 特殊教育']},          
{name:'829 技能培训、教育辅助及其他教育', sectionList:['8291 职业技能培训','8292 体校及体育培训','8293 文化艺术培训','8294 教育辅助服务','8299 其他未列明教育']}
]}
]  
},
{_category:"Q 卫生和社会工作",Alldivision:[   
{name:'83 卫生', groupList:[           
{name:'831 医院', sectionList:['8311 综合医院','8312 中医医院','8313 中西医结合医院','8314 民族医院','8315 专科医院','8316 疗养院']},          
{name:'832 社区医疗与卫生院', sectionList:['8321 社区卫生服务中心（站）','8322 街道卫生院','8323 乡镇卫生院']},             
{name:'833 门诊部（所）', sectionList:['8330 门诊部（所）']},            
{name:'834 计划生育技术服务活动', sectionList:['8340 计划生育技术服务活动']},            
{name:'835 妇幼保健院（所、站）', sectionList:['8350 妇幼保健院（所、站）']},          
{name:'836 专科疾病防治院（所、站）', sectionList:['8360 专科疾病防治院（所、站）']},          
{name:'837 疾病预防控制中心', sectionList:['8370 疾病预防控制中心']},            
{name:'839 其他卫生活动', sectionList:['8390 其他卫生活动']}
]},  
{name:'84 社会工作', groupList:[           
{name:'841 提供住宿社会工作', sectionList:['8411 干部休养所','8412 护理机构服务','8413 精神康复服务','8414 老年人、残疾人养护服务','8415 孤残儿童收养和庇护服务','8419 其他提供住宿社会救助']},          
{name:'842 不提供住宿社会工作', sectionList:['8421 社会看护与帮助服务','8429 其他不提供住宿社会工作']}
]}
]  
},
{_category:"R 文化、体育和娱乐业",Alldivision:[   
{name:'85 新闻和出版业', groupList:[           
{name:'851 新闻业', sectionList:['8510 新闻业']},          
{name:'852 出版业', sectionList:['8521 图书出版','8522 报纸出版','8523 期刊出版','8524 音像制品出版','8525 电子出版物出版','8529 其他出版业']}
]},  
{name:'86 广播、电视、电影和影视录音制作业', groupList:[           
{name:'861 广播', sectionList:['8610 广播']},          
{name:'862 电视', sectionList:['8620 电视']},            
{name:'863 电影和影视节目制作', sectionList:['8630 电影和影视节目制作']},             
{name:'864 电影和影视节目发行', sectionList:['8640 电影和影视节目发行']},          
{name:'865 电影放映', sectionList:['8650 电影放映']},          
{name:'866 录音制作', sectionList:['8660 录音制作']}
]},  
{name:'87 文化艺术业', groupList:[          
{name:'871 文艺创作与表演', sectionList:['8710 文艺创作与表演']},           
{name:'872 艺术表演场馆', sectionList:['8720 艺术表演场馆']},           
{name:'873 图书馆与档案馆', sectionList:['图书馆','8732 档案馆']},           
{name:'874 文物及非物质文化遗产保护', sectionList:['8740 文物及非物质文化遗产保护']},          
{name:'875 博物馆', sectionList:['8750 博物馆']},            
{name:'876 烈士陵园、纪念馆', sectionList:['8760 烈士陵园、纪念馆']},           
{name:'877 群众文化活动', sectionList:['8770 群众文化活动']},           
{name:'879 其他文化艺术业', sectionList:['8790 其他文化艺术业']}
]},  
{name:'88 体育', groupList:[          
{name:'881 体育组织', sectionList:['8810 体育组织']},           
{name:'882 体育场馆', sectionList:['8820 体育场馆']},           
{name:'883 休闲健身活动', sectionList:['8830 休闲健身活动']},           
{name:'889 其他体育', sectionList:['8890 其他体育']}
]},  
{name:'89 娱乐业', groupList:[          
{name:'891 室内娱乐活动', sectionList:['8911 歌舞厅娱乐活动','8912 电子游艺厅娱乐活动','8913 网吧活动','8919 其他室内娱乐活动']},           
{name:'892 游乐园', sectionList:['8920 游乐园']},           
{name:'893 彩票活动', sectionList:['8930 彩票活动']},           
{name:'894 文化、娱乐、体育经纪代理', sectionList:['8941 文化娱乐经纪人','8942 体育经纪人','8949 其他文化艺术经纪代理']},
{name:'899 其他娱乐业', sectionList:['8990 其他娱乐业']},      
]}     
]  
}  ,
{_category:"S 公共管理、社会保障和社会组织",Alldivision:[   
{name:'90 中国共产党机关', groupList:[           
{name:'900 中国共产党机关', sectionList:['9000 中国共产党机关']}
]},  
{name:'91 国家机构', groupList:[           
{name:'911 国家权力机构', sectionList:['9110 国家权力机构']},          
{name:'912 国家行政机构', sectionList:['9121 综合事务管理机构','9122 对外事务管理机构','9123 公共安全管理机构','9124 社会事务管理机构','9125 经济事务管理机构','9126 行政监督检查机构']},            
{name:'913 人民法院和人民检察院', sectionList:['9131 人民法院','9132 人民检察院']},             
{name:'919 其他国家机构', sectionList:['9190 其他国家机构']}
]},  
{name:'92 人民政协、民主党派', groupList:[          
{name:'921 人民政协', sectionList:['9210 人民政协']},           
{name:'922 民主党派', sectionList:['9220 民主党派']}
]},  
{name:'93 社会保障', groupList:[          
{name:'930 社会保障', sectionList:['9300 社会保障']}
]}, 
{name:'94 群众团体、社会团体和其他成员组织', groupList:[           
{name:'941 群众团体', sectionList:['9411 工会','9412 妇联','9413 共青团','9419 其他群众团体']},          
{name:'942 社会团体', sectionList:['9421 专业性团体','9422 行业性团体','9429 其他社会团体']},            
{name:'943 基金会', sectionList:['9430 基金会']},             
{name:'944 宗教组织', sectionList:['9440 宗教组织']}
]},
{name:'95 基层群众自治组织', groupList:[          
{name:'951 社区自治组织', sectionList:['9510 社区自治组织']},
{name:'952 村民自治组织', sectionList:['9520 村民自治组织']},
]}  
]  
},
{_category:"T 国际组织",Alldivision:[   
{name:'96 国际组织', groupList:[           
{name:'960 国际组织', sectionList:['9600 国际组织']} 
]}
]  
}       
];